const dataset = {
  Computer: [
    {
      question:
        '問1 トランスポート層のプロトコルであり、信頼性よりもリアルタイム性が重視される場合に用いられるものはどれか?',
      answers: ['HTTP', 'UDP', 'TCP', 'IP'],
      correct: 'UDP',
      explain: [
        'HTTPはアプリケーション層のプロトコルです',
        'UDPはトランスポート層のプロトコルで信頼性よりも速度を重視したものです',
        'TCPはトランスポート層のプロトコルですが違います',
        'IPはインターネット層のプロトコルです',
      ],
    },
    { question: 'computerクイズ2', answers: ['1.2', '2.2', '3.2', '4.2'] },
    { question: 'computerクイズ3', answers: ['1.3', '2.3', '3.3', '4.3'] },
    { question: 'computerクイズ4', answers: ['1.4', '2.4', '3.4', '4.4'] },
  ],
  Finance: [
    {
      question: '実質金利とは？',
      answers: [
        '名目金利＋物価上昇率',
        '名目金利ー物価上昇率',
        '平均賃金×物価上昇率',
        '平均賃金÷物価上昇率',
      ],
      correct: '名目金利ー物価上昇率',

      explain: [
        '惜しい！年2%の金利が付いても年3%物価が上昇すればお金の価値は年1%下がります！',
        '年2%の金利が付いても年3%物価が上昇すればお金の価値は年1%下がります！',
        '年2%の金利が付いても年3%物価が上昇すればお金の価値は年1%下がります！',
        '年2%の金利が付いても年3%物価が上昇すればお金の価値は年1%下がります！',
      ],
    },
    { question: 'financeクイズ2', answers: ['1.2', '2.2', '3.2', '4.2'] },
    { question: 'financeクイズ3', answers: ['1.3', '2.3', '3.3', '4.3'] },
    { question: 'financeクイズ4', answers: ['1.4', '2.4', '3.4', '4.4'] },
  ],
  Game: [
    {
      question: 'FF10の主人公の名前は？',
      answers: ['アーロン', 'クラウド', 'ユウナ', 'ティーダ'],
      correct: 'ティーダ',
      explain: [
        'FF10に出てくるかっこいいおじさんですが主人公ではありません笑',
        'FF7の主人公です！',
        'FF10のヒロインですが主人公ではありません！',
        'FF10は名作ですね!',
      ],
    },
    { question: 'computerクイズ2', answers: ['1.2', '2.2', '3.2', '4.2'] },
    { question: 'computerクイズ3', answers: ['1.3', '2.3', '3.3', '4.3'] },
    { question: 'computerクイズ4', answers: ['1.4', '2.4', '3.4', '4.4'] },
  ],
  History: [
    {
      question: '本能寺の変を起こした人物の名前はなんでしょう？',
      answers: ['伊達政宗', '徳川家康', '明智光秀', '豊臣秀吉'],
      correct: '明智光秀',
      explain: ['残念！', '残念！', 'さすがです！', '残念!'],
    },
    { question: 'computerクイズ2', answers: ['1.2', '2.2', '3.2', '4.2'] },
    { question: 'computerクイズ3', answers: ['1.3', '2.3', '3.3', '4.3'] },
    { question: 'computerクイズ4', answers: ['1.4', '2.4', '3.4', '4.4'] },
  ],
};

export default dataset;
